Feature: Регистрация на потребител

  Scenario Outline: Регистрация на потребител
    Given Потребителя отваря екрана за регистрация на нов потребител
    When Въведе потребителско име: "<потребителско име>"
    And Въведе парола: "<парола>"
    And Въведе втора парола: "<парола2>"
    And Въведе електронна поща: "<email>"
    And Натисне бутона за регистрация
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      | потребителско име  | парола | парола2      |    email    |     Съобщение                            |
      | Иван               |Иван123 | Иван123      | ivan@abv.bg | Успешна регистрация!                     |
      | Иван               |Иван123 | Иван1233333  | ivan@abv.bg | Въведете еднакви пароли!                 |
      |                    |Иван123 | Иван123      | ivan@abv.bg | Въведете име!                            |
      |        ив          |Иван123 | Иван123      | ivan@abv.bg | Потребителското име трябва да е мин. четери синвола!|
      |      Иван          |Иван123 | Иван123      | тралала     | Въведете валид email!                    |
      |      Иван          |Иван123 | Иван123      |             | Въведете валид email!                    |
      | Иван               |        | Иван123      | ivan@abv.bg | Въведете парола!                         |
      | Иван               |Иван123 |              | ivan@abv.bg | Въведете еднакви пароли!                 |
      | Иван               |        |              | ivan@abv.bg | Въведете парола!                         |
      | Пешо               |Пешо123 | Пешо123      | pesho@abv.bg| Потребителското име е заето!             |
