Feature: Вход в системата

	Background:
    Given Потребителя отваря екрана за вход в системата
	
  Scenario: Вход в системата с валидни потребителски данни
    When Въведе потребителско име: "Иван"
    And въведе потребителска парола: "123!pass"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Успешно влизане!"

  Scenario: Вход в системата без парола
    When Въведе потребителско име: "Иван"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
  Scenario: Вход в системата без потребителско име
    When въведе потребителска парола: "123!pass"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
	Scenario: Вход в системата без потребителски данни
    When натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
  Scenario: Вход в системата с невалидни потребителски данни
    When Въведе потребителско име: "Грешно име"
    And въведе потребителска парола: "123!pass"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Грешни данни!"    